[
  {
    "title": "Winna - No KYC Online Crypto Casino (VPN Friendly too!)",
    "url": "https://reddit.com/r/referralcodes/comments/1ki2hp3/winna_no_kyc_online_crypto_casino_vpn_friendly_too/",
    "author": "Trainers4521",
    "selftext": "I joined Winna a couple of months back and have had a great time so far so thought I’d share it here!\n\nhttps://winna.com/?r=1tc3qB\n\nReasons why I love Winna over Stake/ Roobet..\n\n• No KYC ✨ \n• Instant withdrawals, never an issue ever (I’ve had some BIG wins 🤑)\n• Fantastic live support 📞 \n• Amazing free bonuses, on-site, on Reddit &amp; their telegram! 💸 \n• Great rewards as you move through the VIP tiers😎\n• Great variety of live games/ providers 🎰 \n• VIP Transfer! Transfer your VIP status from many other online crypto casinos such as Stake/ Roobet, etc!\n\nI’ve had my first max win ever on here (15,000x) and some other big wins of over 3,000x in my first couple months. Never had an issue so thought worth a share! ☺️\n\nhttps://winna.com/?r=1tc3qB",
    "upvotes": 21,
    "created_utc": 1746741543
  },
  {
    "title": "Beware: boogies_evasion8p is a scammer, he won't payout.",
    "url": "https://reddit.com/r/referralcodes/comments/1kk43w3/beware_boogies_evasion8p_is_a_scammer_he_wont/",
    "author": "Plus_Tune_7259",
    "selftext": "Scammer tried to delete all his shit after i did his hopper referral but i got proof he didn't pay me my $10. I will comment the link to our convo",
    "upvotes": 19,
    "created_utc": 1746978579
  },
  {
    "title": "Replit promo code, using my referral code for $10 credit",
    "url": "https://reddit.com/r/referralcodes/comments/1kaez1u/replit_promo_code_using_my_referral_code_for_10/",
    "author": "lynchyeatspizza",
    "selftext": "Dove into Replit recently, and it's transformed how I approach coding. With features like Replit Agent and Assistant, you can describe what you want in plain English, and the AI brings it to life. It's not just about writing code; it's about collaborating with AI to build applications efficiently\n\nIf you're considering giving it a shot, using my referral code [https://replit.com/refer/swkzhktcpf](https://replit.com/refer/swkzhktcpf) will get you $10 credit.\n\nReplit supports over 50 programming languages and offers real-time collaboration, making it a versatile platform for both beginners and seasoned developers. Whether you're prototyping an idea or building a full-fledged application, it's worth exploring",
    "upvotes": 15,
    "created_utc": 1745899037
  },
  {
    "title": "This place man",
    "url": "https://reddit.com/r/referralcodes/comments/1kohokz/this_place_man/",
    "author": "KuwabarasHair",
    "selftext": "Got scammed twice right when I joined. Got smarter but in the past 2 days 12 more people tried to get me. Fool me once shame on you. Fool me 3 times won't be fooled again as old bush said. Idk if even worth posting since not one hit. I will continue to monitor trocky and troll his posts from one of my three accounts. That night he got me that was all I had and went hungry. Won't forget that one 🏴‍☠️ Trockytime me and you gonna beef. Realize nobody cares or is reading but wanted to vent",
    "upvotes": 16,
    "created_utc": 1747446508
  },
  {
    "title": "Need 10-15 dollars asap",
    "url": "https://reddit.com/r/referralcodes/comments/1kpq9vq/need_1015_dollars_asap/",
    "author": "thecure001",
    "selftext": "Is there any referral that can let me cash out ten to fifteen dollars to cash app like asap. I’m\nGoing through alcohol withdrawals\nAnd benzos.",
    "upvotes": 14,
    "created_utc": 1747591538
  }
]